load-tests/artillery/participant_flow.yml
config:
  target: "http://localhost:5000"
  engines:
    socketio: {}
  processor: "./custom_helpers.js"
  
  # Phases matching user-specific requirements
  phases:
    - name: "Warm-up (baseline)"
      duration: 30
      arrivalRate: 1
      rampTo: 25
    - name: "Ramping up to Peak Live Load"
      duration: 120
      arrivalRate: 25
      rampTo: 400
    - name: "Hold Peak Concurrent Users (Live Quiz Simulator)"
      duration: 300
      arrivalRate: 400

  # Default environment variables overrides
  variables:
    joinCode: "${JOIN_CODE:-ABC123}"

scenarios:
  - name: "Live Quiz Participant Flow Simulation"
    engine: socketio
    flow:
      # 1. Initialize random details
      - function: "generateParticipantData"

      # 2. Join the quiz lobby via socket connection
      - emit:
          name: "join_quiz"
          data:
            name: "{{ name }}"
            email: "{{ email }}"
            college: "{{ college }}"
            joinCode: "{{ joinCode }}"

      # 3. Verify join success
      - listen:
          event: "join_success"
          timeout: 5000
          capture:
            json: "$.participant.id"
            as: "participantId"

      # 4. Wait for questions released by the Admin host
      # We loop listening for released questions.
      # Artillery's socket.io engine allows looping or waiting for events.
      - loop:
          - listen:
              event: "question_released"
              timeout: 60000 # Wait up to 60s for next question
              capture:
                - json: "$.questionId"
                  as: "currentQuestionId"
                - json: "$.timer"
                  as: "questionTimer"
                  
          # Choose answer option and responseTime dynamically
          - function: "generateAnswerData"
          
          # Simulate reading/thinking time before answering (20-30s)
          # We use think block in Artillery to pause execution for a variable duration
          - think: 20 # seconds
          
          # Submit the chosen option back to the server
          - emit:
              name: "submit_answer"
              data:
                questionId: "{{ currentQuestionId }}"
                selectedAnswer: "{{ selectedAnswer }}"
                responseTime: "{{ responseTime }}"

          # Listen to confirm submission received
          - listen:
              event: "answer_received"
              timeout: 5000
              
          # Wait for question period to end and leaderboard updates
          - listen:
              event: "question_ended"
              timeout: 45000
              
        count: 10 # Simulate a quiz with up to 10 questions

      # 5. Wait for final quiz end event and final leaderboard
      - listen:
          event: "quiz_ended"
          timeout: 120000